Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceNdfType
The property labeled "NDF" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceRoughness
The property labeled "Roughness" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceRotation
The property labeled "Rotation" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceCutout
The property labeled "Image" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceNormal
The property labeled "Image" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceAnisotropy
The property labeled "Anisotropy" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceAlbedo
The property labeled "Color" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueLuminanceModifier
The property labeled "Luminance Scale" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueLuminance
The property labeled "Emissive Luminance" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueEmission
The property labeled "Emission" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueMfpModifier
The property labeled "Translucency Weight" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueMfp
The property labeled "Translucency Depth" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueTranslucency
The property labeled "Translucency" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueF0
The property labeled "Specular reflectance" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueAlbedo
The property labeled "Color" from the "AdvancedOpaque" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedOpaque
A static class that provides access to the property names that appear in the AdvancedOpaque visual asset schema.
Since:
2018.1